timonsku/circuitpython/ports/raspberrypi/boards/adafruit_adv7611/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Adafruit ADV7611"
#define MICROPY_HW_MCU_NAME "rp2040"

#define MICROPY_HW_NEOPIXEL (&pin_GPIO12)

#define DEFAULT_I2C_BUS_SCL (&pin_GPIO17)
#define DEFAULT_I2C_BUS_SDA (&pin_GPIO18)